ednieuw/Arduino-ESP32-Nano-Wordclock/Old/ESP32_WordClockV118/ESP32_WordClockV118.ino
//------------------------------------------------------------------------------              //
// ARDUINO Definition of installed language word clock
//------------------------------------------------------------------------------
                     #ifdef FOURLANGUAGECLOCK
#define NL
#define UK
#define DE
#define FR    
                     #endif //FOURLANGUAGECLOCK
                     #if defined NLM1M2M3M4L94 ||defined NLM1M2M3M4L114 || (defined NLM1M2M3M4L256) || (defined NLM1M2M3M4L144) || (defined NLM1M2M3M4L161)
#define NLM1M2M3M4
                     #endif

                     #ifdef NL144CLOCK
const uint32_t NUM_LEDS  =  144+4;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  12;                                       // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                       // Grid size For digital display mode.
// const uint32_t NUM_LEDS  =  256;                                   // Temporary for testinf with 16x16LED WS2812. To clear all LEDs. During uploading LEDs get randomly On and Off
// const byte MATRIX_WIDTH  =  16;                                    // Grid size For digital display mode.
// const byte MATRIX_HEIGHT =  16;                                    // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);  ColorLeds("", 8,10, 0); Is = true;   // Turn off the WAS LEDs
#define WAS     ColorLeds("was",     8,  10, SECColor);  ColorLeds("", 4, 5, 0); Is = false;  // Turn off the IS LEDs
#define PRECIES ColorLeds("precies", 17, 23, LetterColor);
#define MTIEN   ColorLeds("tien",    12, 15, LetterColor); 
#define MVIJF   ColorLeds("vijf",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   30, 34, LetterColor);
#define VOOR    ColorLeds("voor",    44, 47, LetterColor);
#define OVER    ColorLeds("over",    38, 41, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    66, 69, LetterColor);
#define TWEE    ColorLeds("twee",    60, 63, LetterColor);
#define EEN     ColorLeds("een",     72, 74, LetterColor);
#define VIER    ColorLeds("vier",    77, 80, LetterColor);
#define TIEN    ColorLeds("tien",    91, 94, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84, 89, LetterColor);
#define DRIE    ColorLeds("drie",    96, 99, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   114,117, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    110,112, LetterColor);
#define ZEVEN   ColorLeds("zeven",  121,125, LetterColor);
#define ELF     ColorLeds("elf",    128,130, LetterColor);
#define NOEN    ColorLeds("noen",   139,142, LetterColor);
#define UUR     ColorLeds("uur",    134,136, LetterColor);
#define EDSOFT  ColorLeds("EdSoft", 148,148, LetterColor);
#define MIN1    ColorLeds("M1",     144,144, LetterColor); 
#define MIN2    ColorLeds("M2",     145,145, LetterColor);                                    // MINColor); 
#define MIN3    ColorLeds("M3",     146,146, LetterColor);
#define MIN4    ColorLeds("M4",     147,147, LetterColor);  
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
                     #endif //NL144CLOCK
                     #ifdef NL92CLOCK
const uint32_t NUM_LEDS  =  92;                                                               // How many leds in  strip?
const byte MATRIX_WIDTH  =  10;                                                               // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  10;                                                               // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor); 
#define IS      ColorLeds("is",      3,   4, SECColor);  ColorLeds("", 5, 7, 0); Is = true;   // Turn off the WAS LEDs
#define WAS     ColorLeds("was",     5,   7, SECColor);  ColorLeds("", 3, 4, 0); Is = false;  // Turn off the IS LEDs
#define MVIJF   ColorLeds("vijf",    12, 15, LetterColor); 
#define MTIEN   ColorLeds("tien",    8,  11, LetterColor);
#define KWART   ColorLeds("kwart",   16, 20, LetterColor);
#define VOOR    ColorLeds("voor",    21, 24, LetterColor);
#define OVER    ColorLeds("over",    32, 35, LetterColor);
#define PRECIES ColorLeds("precies", 25, 31, LetterColor);
#define HALF    ColorLeds("half",    36, 39, LetterColor);
#define ELF     ColorLeds("elf",     40, 42, LetterColor);
#define VIJF    ColorLeds("vijf",    47, 50, LetterColor);
#define TWEE    ColorLeds("twee",    43, 46, LetterColor);
#define EEN     ColorLeds("een",     51, 53, LetterColor);
#define VIER    ColorLeds("vier",    54, 57, LetterColor);
#define TIEN    ColorLeds("tien",    64, 67, LetterColor);
#define TWAALF  ColorLeds("twaalf",  58, 63, LetterColor);
#define DRIE    ColorLeds("drie",    68, 71, LetterColor);
#define NEGEN   ColorLeds("negen",   72, 76, LetterColor);
#define ACHT    ColorLeds("acht",    80, 83, LetterColor);
#define ZES     ColorLeds("zes",     77, 79, LetterColor);
#define ZEVEN   ColorLeds("zeven",   84, 88, LetterColor);
#define UUR     ColorLeds("uur",     89,91, LetterColor);
#define EDSOFT  ColorLeds("EdSoft",  92,92, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
#define MIN1    ColorLeds("M1",     144,144, LetterColor); 
#define MIN2    ColorLeds("M2",     145,145, LetterColor);                                    // MINColor); 
#define MIN3    ColorLeds("M3",     146,146, LetterColor);
#define MIN4    ColorLeds("M4",     147,147, LetterColor);  
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
                     #endif //NL92CLOCK

                     #ifdef DE144CLOCK
const uint32_t NUM_LEDS  =  144;                                                              // How many leds in  strip? 
const byte MATRIX_WIDTH  =  12;                                                               // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                                               // Grid size For digital display mode.
#define ES      ColorLeds("Es",       1,   2, LetterColor);   
#define IST     ColorLeds("ist",      4,   6, LetterColor);  ColorLeds("", 8, 10, 0); Is = true;
#define WAR     ColorLeds("war",      8,  10, LetterColor);  ColorLeds("", 4,  6, 0); Is = false;
#define GENAU   ColorLeds("genau",   18,  22, LetterColor);
#define MZEHN   ColorLeds("zehn",    13,  16, LetterColor);
#define MFUNF   ColorLeds("funf",   383, 386, LetterColor);
#define VIERTEL ColorLeds("viertel",375, 381, LetterColor);
#define ZWANZIG ColorLeds("zwanzig",413, 419, LetterColor);
#define KURZ    ColorLeds("kurz",   421, 424, LetterColor);
#define VOR     ColorLeds("vor",    433, 435, LetterColor);
#define NACH    ColorLeds("nach",   427, 430, LetterColor);
#define HALB    ColorLeds("halb",   465, 468, LetterColor);
#define FUNF    ColorLeds("funf",   471, 474, LetterColor);
#define EINS    ColorLeds("eins",   483, 486, LetterColor);
#define VIERDE  ColorLeds("vier",   478, 481, LetterColor);
#define ZEHN    ColorLeds("zehn",   514, 517, LetterColor);
#define ZWOLF   ColorLeds("zwolf",  520, 524, LetterColor);
#define DREI    ColorLeds("drei",   532, 535, LetterColor);
#define NEUN    ColorLeds("neun",   526, 529, LetterColor);
#define ACHTDE  ColorLeds("acht",   565, 568, LetterColor);
#define SECHS   ColorLeds("sechs",  570, 574, LetterColor);
#define SIEBEN  ColorLeds("sieben", 580, 585, LetterColor);
#define ZWEI    ColorLeds("zwei",   575, 578, LetterColor);
#define ELFDE   ColorLeds("elf",    614, 616, LetterColor);
#define UHR     ColorLeds("uhr",    621, 623, LetterColor);
                     #endif //DE144CLOCK
                     #ifdef NLM1M2M3M4L94
const uint32_t NUM_LEDS  =  94;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  10;                                    // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  10;                                    // NA Not used in this clock. 10 is fine 
                   
#define HET     ColorLeds("Het",      0,   2, MINColor);           // Special adapted clock face versie Kris. IS and WAS are equal. There is no WAS
#define IS      ColorLeds("is",       3,   4, SECColor);     Is = true;    //ColorLeds("", 3, 4, 0); 
#define WAS     ColorLeds("was",      3,   4, SECColor);     Is = false;  // ColorLeds("", 3, 4, 0); 
#define MVIJF   ColorLeds("vijf",     5,   8, LetterColor); 
#define MVOOR   ColorLeds("voor",     9,  12, LetterColor);
#define MTIEN   ColorLeds("tien",    13,  16, LetterColor); 
#define OVER    ColorLeds("over",    17,  20, LetterColor);
#define KWART   ColorLeds("kwart",   21,  25, LetterColor);
#define OVER2   ColorLeds("over",    26,  29, LetterColor);
#define HALF    ColorLeds("half",    30,  33, LetterColor);
#define VOOR    ColorLeds("voor",    34,  37, LetterColor);
#define EEN     ColorLeds("een",     38,  40, LetterColor);
#define DRIE    ColorLeds("drie",    41,  44, LetterColor);
#define TWEE    ColorLeds("twee",    45,  48, LetterColor);
#define VIER    ColorLeds("vier",    49,  52, LetterColor);
#define VIJF    ColorLeds("vijf",    53,  56, LetterColor);
#define ZES     ColorLeds("zes",     57,  59, LetterColor);
#define NEGEN   ColorLeds("negen",   60,  64, LetterColor);
#define ZEVEN   ColorLeds("zeven",   65,  69, LetterColor);
#define ACHT    ColorLeds("acht",    70,  73, LetterColor);
#define TIEN    ColorLeds("tien",    74,  77, LetterColor);
#define ELF     ColorLeds("elf",     78,  80, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84,  89, LetterColor);
#define UUR     ColorLeds("uur",     81,  83, LetterColor);
#define MIN1    ColorLeds("M1",      90,  90, LetterColor); 
#define MIN2    ColorLeds("M2",      91,  91, LetterColor);       //MINColor); 
#define MIN3    ColorLeds("M3",      92,  92, LetterColor);
#define MIN4    ColorLeds("M4",      93,  93, LetterColor);  
#define EDSOFT  ColorLeds("EdSoft",  94,  94, LetterColor);  
                     #endif //NLM1M2M3M4L94
                     #ifdef NLM1M2M3M4L114 
const uint32_t NUM_LEDS  =  114;                                                              // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  11;                                                               // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  10;                                                               // NA Not used in this clock. 10 is fine 
                   
